### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [110]:
# Dependencies and Setup
import pandas as pd
import numpy as np

In [111]:
# File to Load (Remember to Change These)
input_file_path = "Resources/purchase_data.csv"

In [116]:
# Read Purchasing File and store into Pandas data frame
game_data_df = pd.read_csv(input_file_path)
# Print Data frame
game_data_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,101,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [115]:
# Clean data - remove rows with missing data in any column - not required 
clean_game_data_df = game_data_df.dropna(how='any')
clean_game_data_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,101,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [117]:
# Display a statistical overview of the data.
game_data_df.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   92.114103    3.050987
std     225.310896    6.659444   52.775943    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   48.000000    1.980000
50%     389.500000   22.000000   93.000000    3.150000
75%     584.250000   25.000000  139.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [118]:
# Calculate total number of "unique" players by using function "value counts"
total_players = len(game_data_df["SN"].value_counts())
total_players

576

In [120]:
# Calculate unique items using function "unique"
unique_items = len(game_data_df["Item ID"].unique())
unique_items

183

In [123]:
# Calculate average price using function "mean" 
average_price = game_data_df["Price"].mean()
average_price

3.0509871794871795

In [124]:
# Calculate total number of purchases using function "count"
total_purchases = game_data_df["Price"].count()
total_purchases

780

In [125]:
# Calculate total revenue using function "sum" 
total_revenue = game_data_df["Price"].sum()
total_revenue

2379.77

## Player Count

* Display the total number of players

In [119]:
# Create a dataframe for the player_count
player_count_df = pd.DataFrame({"Total Players": [total_players]})
player_count_df

   Total Players
0            576

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [126]:
# Create the summary data series
summary = [{"Number of Unique Items": unique_items,
              "Average Price": average_price,
              "Number of Purchases": total_purchases,
              "Total Revenue": total_revenue}]

# Create a dataframe for the summary table 
summary_df = pd.DataFrame(summary)

# Display the summary table with formatting for average price and total revenue
summary_df.style.format({"Average Price": "${:,.2f}",
                         "Total Revenue": "${:,.2f}"})

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

## Purchasing Analysis (Total)

In [147]:
# Calculate gender count (nuniuqe gives teh count of non-NA cells)
gender_count_df = game_data_df.groupby("Gender")["SN"].nunique()
gender_count_df

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [127]:
# Calculate players by gender
players_by_gender = game_data_df["Gender"].value_counts()
players_by_gender

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [128]:
# Calculate total number of players
players_total = game_data_df["Gender"].count()
players_total

780

In [129]:
# Calculate the percentage of each gender
gender_percent = round((players_by_gender/players_total)*100,2)
gender_percent

Male                     83.59
Female                   14.49
Other / Non-Disclosed     1.92
Name: Gender, dtype: float64

In [132]:
# Create Gender demographics summary Dataframe
gender_demographics_df= pd.DataFrame({"Total Count": players_by_gender, 
                                    "Percentage of Players": gender_percent})

# Display the Gender demographics summary with formatting for Percentage of players
gender_demographics_df.style.format ({"Percentage of Players": "{:,.2f}%"})

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [158]:
# Total number of purchases grouped by gender
gender_purchases_df = game_data_df.groupby("Gender")["Item ID"]
gender_purchases_df.count()

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Item ID, dtype: int64

In [152]:
# Calculate average price of items by gender
avg_price_by_gender_df = game_data_df.groupby("Gender")["Price"].mean()
avg_price_by_gender_df.round(2)

Gender
Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
Name: Price, dtype: float64

In [153]:
# Calculate total purchase value by gender
gender_total_df = game_data_df.groupby("Gender")["Price"].sum()
gender_total_df.round(2)

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [154]:
# Calculate purchase price per person by gender
price_per_person_df = gender_total_df/gender_count
price_per_person_df.round(2)

Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
dtype: float64

In [161]:
# Create the summary dataframe
gender_analysis_df = pd.DataFrame({"Purchase Count": gender_purchases_df, 
                                      "Average Purchase Price": avg_price_by_gender_df,
                                     "Total Purchase Price": gender_total_df,
                                     "Average Total Purchase Per Person": price_per_person_df})
 
# Display the summary dataframe with formatting

gender_analysis_df.style.format({"Average Purchase Price": "${:,.2f}",
                                "Total Purchase Price": "${:,.2f}",
                                "Average Total Purchase Per Person": "${:,.2f}"})

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table


## Purchasing Analysis (Gender)

In [ ]:
# Age Demographics
# Create bins for ages
bins = [0, 10, 15, 20, 25, 30, 35, 40, 100]
group_names = ['<10', '10-14', '15-19', '20-24', '25-29', '30-34', '35-39', '40+']

In [164]:
# Categorize players using age bins using pd.cut()
game_data_df ["Age Range"] = pd.cut(game_data_df["Age"], bins, labels=group_names)
game_data_df ["Age Range"]

0      15-19
1      35-39
2      20-24
3      20-24
4      20-24
       ...
775    20-24
776    20-24
777    15-19
778      <10
779    20-24
Name: Age Range, Length: 780, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [168]:
# Categorize players using age bins using pd.cut()
game_data_df ["Age Range"] = pd.cut(game_data_df["Age"], bins, labels=group_names)
game_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15-19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,35-39
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [176]:
# Player count by age range
age_range_count_df = game_data_df.groupby("Age Range")["Item ID"]
age_range_count_df.count()

Age Range
<10       32
10-14     54
15-19    200
20-24    325
25-29     77
30-34     52
35-39     33
40+        7
Name: Item ID, dtype: int64

In [184]:
# NEED HELP Calculate the percentages by age group
x = game_data_df["Age Range"].value_counts()
age_percent = x/player_count_df
age_percent

   10-14  15-19  20-24  25-29  30-34  35-39  40+  <10  Total Players
0    NaN    NaN    NaN    NaN    NaN    NaN  NaN  NaN            NaN

In [185]:
# Group by Age 
age_groups = game_data_df.groupby(["Age Range"])

In [187]:
# Create a summary data frame to hold the results
age_demographics_df = pd.DataFrame({"Total Count": age_range_count_df}

# Display the Age Demographics table - using the sort_index function
age_demographics_df

                                         Total Count
0  (<10, [96, 133, 44, 73, 116, 25, 50, 174, 60, ...
1  (10-14, [71, 108, 27, 88, 140, 87, 2, 158, 65,...
2  (15-19, [108, 162, 40, 57, 168, 140, 160, 143,...
3  (20-24, [92, 100, 131, 81, 21, 95, 162, 116, 4...
4  (25-29, [89, 141, 178, 76, 102, 178, 143, 15, ...
5  (30-34, [136, 165, 110, 176, 44, 124, 20, 33, ...
6  (35-39, [143, 169, 24, 151, 179, 99, 102, 117,...
7               (40+, [137, 71, 173, 8, 77, 93, 17])

In [109]:
# Create a summary data frame to hold the results
age_demographics_df = pd.DataFrame({"Total Count": age_range_count_df,
                                    "Percentage of Players": age_percent})

# Display the Age Demographics table - using the sort_index function
age_demographics_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Total Count
Age Range,,,,,,,,
<10,32,32,32,32,32,32,32,32
10-14,54,54,54,54,54,54,54,54
15-19,200,200,200,200,200,200,200,200
20-24,325,325,325,325,325,325,325,325
25-29,77,77,77,77,77,77,77,77
30-34,52,52,52,52,52,52,52,52
35-39,33,33,33,33,33,33,33,33
40+,7,7,7,7,7,7,7,7

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80